create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.200 [get_ports {a[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {a[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.200 [get_ports {b[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {b[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.200 [get_ports cin]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports cin]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.200 [get_ports resetn]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports resetn]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.200 [get_ports {sum[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.350 [get_ports {sum[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.200 [get_ports carry]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.350 [get_ports carry]
