create_clock -period 10.000 -name wclk -waveform {0.000 5.000} [get_ports wclk]
create_clock -period 20.000 -name rclk -waveform {0.000 10.000} [get_ports rclk]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks rclk] -min -add_delay 2.000 [get_ports rd_en]
set_input_delay -clock [get_clocks rclk] -max -add_delay 4.000 [get_ports rd_en]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports rstn]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports rstn]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports wr_en]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports wr_en]
set_output_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks rclk] -max -add_delay 1.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports empty]
set_output_delay -clock [get_clocks rclk] -max -add_delay 1.000 [get_ports empty]
set_output_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports full]
set_output_delay -clock [get_clocks wclk] -max -add_delay 1.000 [get_ports full]
set_clock_groups -asynchronous -group [get_clocks rclk] -group [get_clocks wclk]
set_property ASYNC_REG true [get_cells {rdpntr_sync1[*]}]
set_property ASYNC_REG true [get_cells {rdpntr_sync2[*]}]
set_property ASYNC_REG true [get_cells {wrpntr_sync1[*]}]
set_property ASYNC_REG true [get_cells {wrpntr_sync2[*]}]