create_clock -period 10.000 -name virtual_clock
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[0]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports carry]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports carry]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[0]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[1]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[1]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[2]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[2]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[3]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[3]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[4]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[4]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[5]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[5]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[6]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[6]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[7]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[7]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {sum[8]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {sum[8]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[1]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[1]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[2]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[2]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[3]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[4]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[4]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[5]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[5]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[6]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[6]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {a[7]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {a[7]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[0]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[0]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[1]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[1]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[2]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[2]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[3]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[4]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[4]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[5]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[5]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[6]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[6]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports {b[7]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {b[7]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.300 [get_ports cin]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports cin]
