create_clock -period 10.000 -name rclk -waveform {0.000 5.000} [get_ports rclk]
create_clock -period 20.000 -name wclk -waveform {0.000 10.000} [get_ports wclk]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports {wdata[*]}]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports {wdata[*]}]
set_input_delay -clock [get_clocks rclk] -min -add_delay 2.000 [get_ports rinc]
set_input_delay -clock [get_clocks rclk] -max -add_delay 4.000 [get_ports rinc]
set_input_delay -clock [get_clocks rclk] -min -add_delay 2.000 [get_ports rrst_n]
set_input_delay -clock [get_clocks rclk] -max -add_delay 4.000 [get_ports rrst_n]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports winc]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports winc]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports wrst_n]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports wrst_n]
set_property ASYNC_REG true [get_cells {sync_w2r/rq1_wptr_reg[4]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq2_wptr_reg[4]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq1_wptr_reg[0]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq2_wptr_reg[0]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq1_wptr_reg[1]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq2_wptr_reg[1]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq1_wptr_reg[2]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq2_wptr_reg[2]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq1_wptr_reg[3]}]
set_property ASYNC_REG true [get_cells {sync_w2r/rq2_wptr_reg[3]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq1_rptr_reg[4]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq2_rptr_reg[4]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq1_rptr_reg[1]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq2_rptr_reg[1]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq1_rptr_reg[0]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq2_rptr_reg[0]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq1_rptr_reg[3]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq2_rptr_reg[3]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq1_rptr_reg[2]}]
set_property ASYNC_REG true [get_cells {sync_r2w/wq2_rptr_reg[2]}]
set_output_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports {rdata[*]}]
set_output_delay -clock [get_clocks rclk] -max -add_delay 2.000 [get_ports {rdata[*]}]
set_output_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports {rdata[*]}]
set_output_delay -clock [get_clocks wclk] -max -add_delay 2.000 [get_ports {rdata[*]}]
set_output_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports rempty]
set_output_delay -clock [get_clocks rclk] -max -add_delay 2.000 [get_ports rempty]
set_output_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports wfull]
set_output_delay -clock [get_clocks wclk] -max -add_delay 2.000 [get_ports wfull]
set_clock_groups -asynchronous -group [get_clocks wclk] -group [get_clocks rclk]
set_clock_groups -asynchronous -group [get_clocks rclk] -group [get_clocks wclk]
