create_clock -period 20.000 -name rclk -waveform {0.000 10.000} [get_ports rclk]
create_clock -period 10.000 -name wclk -waveform {0.000 5.000} [get_ports wclk]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks rclk] -min -add_delay 2.000 [get_ports rd_en]
set_input_delay -clock [get_clocks rclk] -max -add_delay 4.000 [get_ports rd_en]
set_input_delay -clock [get_clocks rclk] -min -add_delay 2.000 [get_ports rrstn]
set_input_delay -clock [get_clocks rclk] -max -add_delay 4.000 [get_ports rrstn]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports wr_en]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports wr_en]
set_input_delay -clock [get_clocks wclk] -min -add_delay 2.000 [get_ports wrstn]
set_input_delay -clock [get_clocks wclk] -max -add_delay 4.000 [get_ports wrstn]
set_output_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks rclk] -max -add_delay 2.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks wclk] -max -add_delay 2.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks rclk] -min -add_delay 0.000 [get_ports empty]
set_output_delay -clock [get_clocks rclk] -max -add_delay 2.000 [get_ports empty]
set_output_delay -clock [get_clocks wclk] -min -add_delay 0.000 [get_ports full]
set_output_delay -clock [get_clocks wclk] -max -add_delay 2.000 [get_ports full]
set_property ASYNC_REG true [get_cells {wpntr_reg[*]}]
set_property ASYNC_REG true [get_cells {rpntr_reg[*]}]
set_property ASYNC_REG true [get_cells {wptr_d1_reg[*]}]
set_property ASYNC_REG true [get_cells {wptr_d2_reg[*]}]
set_property ASYNC_REG true [get_cells {rptr_d1_reg[*]}]
set_property ASYNC_REG true [get_cells {rptr_d2_reg[*]}]

set_clock_groups -asynchronous -group [get_clocks wclk] -group [get_clocks rclk]
set_clock_groups -asynchronous -group [get_clocks rclk] -group [get_clocks wclk]
